Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Unsupported token: %@
fr: Token non pris en charge : %@
ko: 지원되지 않는 토큰: %@
tr: Desteklenmeyen belirteç: %@
vi: Token không được hỗ trợ: %@
zh_hans: 不支持的标记：%@
zh_hant: 不支援的權杖：%@

source: Exports
fr: Exportations
ko: 내보내기
tr: Dışa Aktarımlar
vi: Bản xuất
zh_hans: 导出
zh_hant: 匯出

source: Model ID
fr: ID du modèle
ko: 모델 ID
tr: Model Kimliği
vi: ID mô hình
zh_hans: 模型 ID
zh_hant: 模型 ID

# No free port in range %d-%d
source: No free port in range %1$d-%2$d
fr: Pas de port gratuit dans la plage %1$d-%2$d
ko: 범위 %1$d-%2$d에 사용 가능한 포트가 없습니다
tr: %d-%d aralığında boş port yok
vi: Không có port trống trong khoảng %d-%d
zh_hans: 在 %d-%d 范围内没有可用端口
zh_hant: 在 %1$d-%2$d 範圍內沒有可用的連接埠

source: Outgoing foreign keys
fr: Clés étrangères sortantes
ko: 나가는 외래 키
tr: Giden yabancı anahtarlar
vi: Khoá ngoại đi ra
zh_hans: 出向外键
zh_hant: 出向外鍵

source: One entry per query or table
fr: Une entrée par requête ou table
ko: 쿼리 또는 테이블마다 한 항목
tr: Sorgu veya tablo başına bir girdi
vi: Mỗi truy vấn hoặc bảng một mục
zh_hans: 每个查询或每张表一个条目
zh_hant: 每個查詢或每張資料表一個項目

source: Runs the profile's credential_process command.
fr: Exécute la commande credential_process du profil.

source: Enable SSH Tunnel
fr: Activer le tunnel SSH
ko: SSH 터널 활성화
tr: SSH Tünelini Etkinleştir
vi: Bật đường hầm SSH
zh_hans: 启用 SSH 隧道
zh_hant: 啟用 SSH 隧道

source: Move Down (⌘↓)
fr: Avancer vers le bas (⌘↓)
ko: 아래로 이동 (⌘↓)
tr: Aşağı Taşı (⌘↓)
vi: Di chuyển xuống (⌘↓)
zh_hans: 下移 (⌘↓)
zh_hant: 下移 (⌘↓)

source: Uses the access key stored in ~/.aws/credentials.
fr: Utilise la clé d'accès stockée dans ~/.aws/credentials.

source: An internal or external stage. The role you are connected as needs write access to it.
fr: Une étape interne ou externe. Le rôle auquel vous êtes connecté a besoin d'un accès écrit à celle-ci.

source: AI Actions
fr: Actions IA

source: Member
fr: Membre
ko: 멤버
tr: Üye
vi: Thành viên
zh_hans: 成员
zh_hant: 成員

source: List tables and views in a database
fr: Liste des tables et des vues dans une base de données
ko: 데이터베이스의 테이블 및 뷰 나열
tr: Bir veritabanındaki tabloları ve görünümleri listele
vi: Liệt kê bảng và view trong một cơ sở dữ liệu
zh_hans: 列出数据库中的表和视图
zh_hant: 列出資料庫中的資料表與檢視表

source: Install from File...
fr: Installer à partir du fichier...
ko: 파일에서 설치...
tr: Dosyadan Yükle...
vi: Cài đặt từ tập tin...
zh_hans: 从文件安装...
zh_hant: 從檔案安裝…

source: Load Models
fr: Charger les modèles
ko: 모델 불러오기
tr: Modelleri Yükle
vi: Tải mô hình
zh_hans: 加载模型
zh_hant: 載入模型

source: Pass at least one row.
fr: Passez au moins une rangée.
ko: 행을 하나 이상 전달하십시오.
tr: En az bir satır geçirin.
vi: Hãy truyền ít nhất một dòng.
zh_hans: 请至少传入一行。
zh_hant: 請至少傳入一列。

source: Ask AI to Fix
fr: Demandez à l'IA de réparer
ko: AI에게 수정 요청
tr: Düzeltmesi için Yapay Zekaya Sor
vi: Nhờ AI sửa lỗi
zh_hans: 让 AI 修复
zh_hant: 讓 AI 修正

# The %@ line in ~/.ssh/config uses ${%@}, which is not set in the environment.
source: The %1$@ line in ~/.ssh/config uses ${%2$@}, which is not set in the environment.
fr: La ligne %1$@ dans ~/.ssh/config utilise ${%2$@}, qui n'est pas définie dans l'environnement.

source: Edit the connection and choose its database type.
fr: Modifiez la connexion et choisissez son type de base de données.

source: Suggest optimizations for the current query
fr: Proposer des optimisations pour la requête actuelle
ko: 현재 쿼리의 최적화 제안
tr: Geçerli sorgu için optimizasyon öner
vi: Gợi ý tối ưu cho truy vấn hiện tại
zh_hans: 为当前查询提供优化建议
zh_hant: 為目前的查詢提供最佳化建議

source: Statement batches
fr: Lot de déclarations
ko: 명령문 배치
tr: İfade grupları
vi: Các lô câu lệnh
zh_hans: 语句批次
zh_hant: 陳述式批次

source: Certificate
fr: Certificat
ko: 인증서
tr: Sertifika
vi: Chứng chỉ
zh_hans: 证书
zh_hant: 憑證

source: External Clients
fr: Clients externes
ko: 외부 클라이언트
tr: Harici İstemciler
vi: Client bên ngoài
zh_hans: 外部客户端
zh_hant: 外部用戶端

source: Cursor CLI failed: %@
fr: Erreur de la CLI du curseur : %@
ko: Cursor CLI 실패: %@
tr: Cursor CLI başarısız oldu: %@
vi: Cursor CLI thất bại: %@
zh_hans: Cursor CLI 失败：%@
zh_hant: Cursor CLI 失敗：%@

source: The AI assistant
fr: L'assistant IA

source: Could not connect to %@
fr: Impossible de se connecter à %@
ko: %@에 연결할 수 없습니다
tr: %@ bağlantısı kurulamadı
vi: Không thể kết nối tới %@
zh_hans: 无法连接到 %@
zh_hant: 無法連線到 %@

source: Maximum entries cannot be negative
fr: Les entrées maximales ne peuvent pas être négatives.
ko: 최대 항목 수는 음수일 수 없습니다
tr: Maksimum kayıt negatif olamaz
vi: Số mục tối đa không được là số âm
zh_hans: 最大条目数不能为负数
zh_hant: 最大項目數不能為負數

source: Answered with %d tools.
fr: Répondu avec %d outils.

source: Folder
fr: Dossier
ko: 폴더
tr: Klasör
vi: Thư mục
zh_hans: 文件夹
zh_hant: 資料夾

source: Welcome to TablePro
fr: Bienvenue sur TablePro
ko: TablePro에 오신 것을 환영합니다
tr: TablePro'ya Hoş Geldiniz
vi: Chào mừng đến với TablePro
zh_hans: 欢迎使用 TablePro
zh_hant: 歡迎使用 TablePro

source: This DELETE query has no WHERE clause and will delete ALL rows in the table. This action cannot be undone.
fr: Cette requête de suppression n'a pas de clause WHERE et supprira TOUTES les lignes de la table. Cette action ne peut pas être annulée.
ko: 이 DELETE 쿼리에는 WHERE 절이 없으므로 테이블의 모든 행이 삭제됩니다. 이 작업은 실행 취소할 수 없습니다.
vi: Truy vấn DELETE này không có mệnh đề WHERE và sẽ xóa TẤT CẢ dòng trong bảng. Thao tác này không thể hoàn tác.
zh_hans: 此 DELETE 查询没有 WHERE 子句，将删除表中的所有行。此操作无法撤销。
zh_hant: 此 DELETE 查詢沒有 WHERE 子句，將刪除資料表中的所有列。此動作無法復原。

source: Principal name
fr: Nom du principal
ko: 주체 이름
tr: Asıl adı
vi: Tên principal
zh_hans: 主体名称
zh_hant: 主體名稱

source: Save passphrase in Keychain
fr: Sauvegarder le mot de passe dans le portefeuille clé
ko: 키체인에 암호 저장
tr: Parolayı Keychain'e kaydet
vi: Lưu cụm mật khẩu vào Keychain
zh_hans: 将密码保存到钥匙串
zh_hant: 將通關密語儲存至鑰匙圈

source: Toggle Assistant
fr: Assistant de commutation

source: Table comment
fr: Commentaire de la table
ko: 테이블 주석
tr: Tablo yorumu
vi: Ghi chú bảng
zh_hans: 表注释
zh_hant: 資料表註解

source: Select a table to see its row differences.
fr: Sélectionnez une table pour voir ses différences de lignes.
ko: 행 차이를 보려면 테이블을 선택하십시오.
tr: Satır farklarını görmek için bir tablo seçin.
vi: Chọn một bảng để xem khác biệt theo dòng của nó.
zh_hans: 选择一个表以查看它的行差异。
zh_hant: 選擇一個資料表以查看它的列差異。

source: Uses this Mac's Application Default Credentials. Run `gcloud auth application-default login` first, or set GOOGLE_APPLICATION_CREDENTIALS.
fr: Utilise les informations de connexion par défaut de l'application de ce Mac. Exécutez d'abord `gcloud auth application-default login`, ou définissez GOOGLE_APPLICATION_CREDENTIALS.
ko: 이 Mac의 Application Default Credentials를 사용합니다. 먼저 `gcloud auth application-default login`을 실행하거나 GOOGLE_APPLICATION_CREDENTIALS를 설정하십시오.
tr: Bu Mac'teki Application Default Credentials'ı kullanır. Önce `gcloud auth application-default login` çalıştırın veya GOOGLE_APPLICATION_CREDENTIALS ayarlayın.
vi: Dùng Application Default Credentials của máy Mac này. Hãy chạy `gcloud auth application-default login` trước, hoặc đặt GOOGLE_APPLICATION_CREDENTIALS.
zh_hans: 使用这台 Mac 的 Application Default Credentials。请先运行 `gcloud auth application-default login`，或设置 GOOGLE_APPLICATION_CREDENTIALS。
zh_hant: 使用這台 Mac 的 Application Default Credentials。請先執行 `gcloud auth application-default login`，或設定 GOOGLE_APPLICATION_CREDENTIALS。

source: xAI did not return an access token.
fr: xAI n'a pas renvoyé un jeton d'accès.
ko: xAI에서 접근 토큰을 반환하지 않았습니다.
tr: xAI bir erişim belirteci döndürmedi.
vi: xAI không trả về access token.
zh_hans: xAI 未返回访问令牌。
zh_hant: xAI 未回傳存取權杖。

source: SSH Verification Rejected
fr: Vérification SSH rejetée
ko: SSH 확인 거부됨
tr: SSH Doğrulaması Reddedildi
vi: Xác minh SSH bị từ chối
zh_hans: SSH 验证被拒绝
zh_hant: SSH 驗證遭拒

source: No connections saved yet.
fr: Aucune connexion n'a encore été enregistrée.

source: Filter keys and values. Wrap in slashes for a regular expression.
fr: Filtrez les clés et les valeurs. Enveloppez-les dans des tirets pour une expression régulière.

source: global
fr: mondial
ko: 전역
tr: genel
vi: toàn cục
zh_hans: 全局
zh_hant: 全域

source: Not selected
fr: Non sélectionné

source: No primary key selected (not recommended)
fr: Aucune clé primaire sélectionnée (non recommandée)
ko: 선택된 기본 키 없음(권장하지 않음)
vi: Chưa chọn khóa chính (không khuyến nghị)
zh_hans: 未选择主键（不推荐）
zh_hant: 未選擇主鍵（不建議）

# %@ must be %d characters or less
source: %1$@ must be %2$d characters or less
fr: %1$@ doit être composé de %2$d caractères ou moins.
ko: %1$@ 길이는 %2$d자 이하여야 합니다
tr: %@ en fazla %d karakter olmalıdır
vi: %@ phải có %d ký tự trở xuống
zh_hans: %@不能超过%d个字符
zh_hant: %1$@ 不能超過 %2$d 個字

source: %@ names a connection that no longer exists.
fr: %@ nomme une connexion qui n'existe plus.

source: A key from the xAI Console bills xAI API credits. Grok 4.5 and Grok 4.3 are available.
fr: Une clé de la console xAI facture les crédits de l'API xAI. Grok 4.5 et Grok 4.3 sont disponibles.
ko: xAI Console 키를 사용하면 xAI API 크레딧이 차감됩니다. Grok 4.5와 Grok 4.3을 사용할 수 있습니다.
tr: xAI Console'dan alınan bir anahtar xAI API kredilerinden düşer. Grok 4.5 ve Grok 4.3 kullanılabilir.
vi: Khóa lấy từ xAI Console sẽ tính phí vào tín dụng API của xAI. Có sẵn Grok 4.5 và Grok 4.3.
zh_hans: 使用 xAI Console 的密钥会扣除 xAI API 额度。可用 Grok 4.5 和 Grok 4.3。
zh_hant: 使用 xAI Console 的金鑰會扣除 xAI API 額度。可使用 Grok 4.5 和 Grok 4.3。

source: Default Port:
fr: Port par défaut :
ko: 기본 포트:
tr: Varsayılan Port:
vi: Cổng mặc định:
zh_hans: 默认端口:
zh_hant: 預設連接埠：

source: Could not save the connection. Check disk space and permissions, then try again.
fr: Impossible d'enregistrer la connexion. Vérifiez l'espace disque et les autorisations, puis réessayez.
ko: 연결을 저장할 수 없습니다. 디스크 공간과 권한을 확인한 후 다시 시도하십시오.
tr: Bağlantı kaydedilemedi. Disk alanını ve izinleri denetleyin, sonra yeniden deneyin.
vi: Không thể lưu kết nối. Kiểm tra dung lượng đĩa và quyền truy cập, rồi thử lại.
zh_hans: 无法保存连接。请检查磁盘空间和权限，然后重试。
zh_hant: 無法儲存連線。請檢查磁碟空間與權限，然後再試一次。

source: Connection error
fr: Erreur de connexion

source: Loading plugins...
fr: Chargement des plugins...
ko: 플러그인 불러오는 중...
tr: Eklentiler yükleniyor...
vi: Đang tải plugin...
zh_hans: 正在加载插件...
zh_hant: 正在載入外掛…

source: No open tab this client may reach has that id.
fr: Aucun onglet ouvert que ce client puisse atteindre n'a cet identifiant.
ko: 이 클라이언트가 접근할 수 있는 열린 탭 중 해당 id를 가진 탭이 없습니다.
tr: Bu istemcinin erişebildiği açık sekmeler arasında bu kimliğe sahip bir sekme yok.
vi: Không có tab đang mở nào mà client này truy cập được có id đó.
zh_hans: 此客户端可访问的已打开标签页中没有这个 id。
zh_hant: 此用戶端可存取的已開啟標籤頁中沒有這個 id。

source: No remote database file was named for this connection.
fr: Aucune fichier de base de données distante n'a été nommé pour cette connexion.
ko: 이 연결에 대해 원격 데이터베이스 파일이 지정되지 않았습니다.
tr: Bu bağlantı için uzak bir veritabanı dosyası belirtilmedi.
vi: Chưa có tệp cơ sở dữ liệu từ xa nào được đặt cho kết nối này.
zh_hans: 此连接没有指定远程数据库文件。
zh_hant: 此連線沒有指定遠端資料庫檔案。

source: Not described: %@
fr: Non décrit : %@

source: Nothing was saved, and every change is still pending. Undo what cannot be written, or make it with a query, then save again.
fr: Rien n'a été sauvegardé, et chaque modification est toujours en attente. Annulez ce qui ne peut pas être écrit, ou faites-le avec une requête, puis sauvegardez à nouveau.

source: Recent Sessions
fr: Sessions récentes

source: Rename Folder
fr: Renommer le dossier

source: current
fr: actuel
ko: 현재
vi: hiện tại
zh_hans: 当前
zh_hant: 目前

source: Whether it succeeded
fr: Que cela ait réussi ou non
ko: 성공했는지 여부
tr: Başarılı olup olmadığı
vi: Có thành công hay không
zh_hans: 是否成功
zh_hant: 是否成功

source: Indent
fr: Entaille
ko: 들여쓰기
tr: Girintile
vi: Thụt lề
zh_hans: 缩进
zh_hant: 縮排

source: hostname:%lld
fr: Nom d'hôte : %lld

source: Could not find %@ data files
fr: Impossible de trouver les fichiers de données %@
ko: %@ 데이터 파일을 찾을 수 없습니다
tr: %@ veri dosyaları bulunamadı
vi: Không tìm thấy tệp dữ liệu %@
zh_hans: 找不到 %@ 数据文件
zh_hant: 找不到 %@ 資料檔案

source: Row Details
fr: Détails de la rangée
ko: 행 세부사항
vi: Chi tiết dòng
zh_hans: 行详情
zh_hant: 列詳細資訊

source: %d skipped
fr: %d sauté
ko: %d개 건너뜀
tr: %d atlandı
vi: đã bỏ qua %d
zh_hans: 已跳过 %d 行
zh_hant: 已略過 %d 列

source: Table to explain
fr: Tableau à expliquer
ko: 설명할 테이블
tr: Açıklanacak tablo
vi: Bảng cần giải thích
zh_hans: 要讲解的表
zh_hant: 要講解的資料表

source: Copilot subscription inactive
fr: Abonnement Copilot inactif
ko: Copilot 구독이 비활성 상태입니다
tr: Copilot aboneliği aktif değil
vi: Gói Copilot không hoạt động
zh_hans: Copilot 订阅未激活
zh_hant: Copilot 訂閱未啟用

source: Export completed
fr: Exportation terminée
ko: 내보내기 완료
tr: Dışa aktarma tamamlandı
vi: Đã xuất xong
zh_hans: 导出完成
zh_hant: 匯出完成

source: Get detailed status for a specific database connection.
fr: Obtenez un état détaillé pour une connexion de base de données spécifique.
ko: 특정 데이터베이스 연결의 상세 상태를 가져옵니다.
tr: Belirli bir veritabanı bağlantısının ayrıntılı durumunu alır.
vi: Lấy trạng thái chi tiết của một kết nối cơ sở dữ liệu cụ thể.
zh_hans: 获取特定数据库连接的详细状态。
zh_hant: 取得特定資料庫連線的詳細狀態。

source: Check Status
fr: Vérifier l'état
ko: 상태 확인
tr: Durumu Kontrol Et
vi: Kiểm tra trạng thái
zh_hans: 检查状态
zh_hant: 檢查狀態

source: Pending Write Batches
fr: Batches d'écriture en attente

source: %1$@ could not be read again before generating the script. %2$@
fr: %1$@ n'a pas pu être lu à nouveau avant la génération du script. %2$@

source: Ask
fr: Demander
ko: 질문
tr: Sor

source: The statement before it stays applied.
fr: La déclaration précédente reste appliquée.

source: Edit provider
fr: Modifier le fournisseur
ko: 제공자 편집
tr: Sağlayıcıyı düzenle
vi: Chỉnh sửa nhà cung cấp
zh_hans: 编辑提供商
zh_hant: 編輯供應商

source: Select Tab %lld
fr: Sélectionner la barre d'onglets %lld
ko: 탭 %lld 선택
vi: Chọn tab %lld
zh_hans: 选择标签页 %lld
zh_hant: 選擇分頁 %lld

source: Switch %@
fr: Échangez %@
ko: %@ 전환
tr: %@ Değiştir
vi: Chuyển %@
zh_hans: 切换 %@
zh_hant: 切換 %@

source: Runs against %@
fr: Fonctionne contre %@

source: Too many lines differ to compare line by line.
fr: Trop de lignes diffèrent pour comparer ligne par ligne.
ko: 달라진 줄이 너무 많아 줄 단위로 비교할 수 없습니다.
tr: Satır satır karşılaştırmak için çok fazla satır farklı.
vi: Có quá nhiều dòng khác nhau để so sánh từng dòng.
zh_hans: 不同的行太多，无法逐行比较。
zh_hant: 不同的行太多，無法逐行比較。

source: %@ name
fr: %@ nom
ko: %@ 이름
tr: %@ adı
vi: Tên %@
zh_hans: %@ 名称
zh_hant: %@ 名稱

source: View body
fr: Voir le corps
ko: 뷰 본문
tr: Görünüm gövdesi
vi: Thân view
zh_hans: 视图主体
zh_hant: 檢視表主體

source: Open Redis CLI
fr: Ouvrir la CLI Redis
ko: Redis CLI 열기
vi: Mở Redis CLI
zh_hans: 打开 Redis CLI
zh_hant: 開啟 Redis CLI

source: New Query Tab
fr: Nouvelle onglet de requête
ko: 새 쿼리 탭
tr: Yeni Sorgu Sekmesi
vi: Tab truy vấn mới
zh_hans: 新建查询标签页
zh_hant: 新增查詢分頁

source: Value excluded from query
fr: Valeur exclue de la requête
ko: 쿼리에서 제외된 값
tr: Sorgudan hariç tutulan değer
vi: Giá trị bị loại khỏi truy vấn
zh_hans: 从查询中排除的值
zh_hant: 已從查詢中排除的值

source: Routes through a SOCKS5 proxy, which also resolves the database hostname.
fr: Itinéraires via un proxy SOCKS5, qui résout également le nom de domaine de la base de données.

source: Publish Saved Queries to Team...
fr: Publier les requêtes enregistrées sur l'équipe...
ko: 저장된 쿼리를 팀에 게시...
tr: Kayıtlı Sorguları Takıma Yayınla...
vi: Xuất bản truy vấn đã lưu cho nhóm...
zh_hans: 将已保存的查询发布给团队...
zh_hant: 將已儲存的查詢發佈給團隊...

source: Extra Large
fr: Extra grand
ko: 특대
tr: Çok Büyük
vi: Rất lớn
zh_hans: 特大
zh_hant: 特大

source: Loading devices…
fr: Chargement des appareils...
ko: 기기를 불러오는 중…
tr: Cihazlar yükleniyor…
vi: Đang tải thiết bị…
zh_hans: 正在载入设备…
zh_hant: 正在載入裝置…

source: The run was rolled back, but %@ cannot roll back, so the rows already written there stay. Compare again to see where the target stands.
fr: La mise à jour a été annulée, mais %@ ne peut pas être annulée, donc les lignes déjà écrites restent là. Comparez à nouveau pour voir où se trouve la cible.

source: %1$@ could not represent %2$@ and other characters. Each was written as "?".
fr: %1$@ n'a pas pu représenter %2$@ et d'autres caractères. Chacun a été écrit comme "?".
ko: %1$@에서 %2$@ 및 기타 문자를 표현할 수 없어 각각 "?"로 기록했습니다.
tr: %1$@ şunları ve diğer karakterleri temsil edemedi: %2$@. Her biri "?" olarak yazıldı.
vi: %1$@ không thể biểu diễn %2$@ và các ký tự khác. Mỗi ký tự được ghi thành "?".
zh_hans: %1$@ 无法表示 %2$@ 及其他字符。每个字符均写为 "?"。
zh_hant: %1$@ 無法表示 %2$@ 及其他字元。每個字元均寫為 "?"。

source: This column holds %@, which the map cannot draw.
fr: Cette colonne contient %@, ce que la carte ne peut pas dessiner.

source: Colors
fr: Couleurs
ko: 색상
tr: Renkler
vi: Màu sắc
zh_hans: 颜色
zh_hant: 顏色

source: Schema name. Uses the connection's current schema when omitted.
fr: Nom du schéma. Utilise le schéma actuel de la connexion lorsqu'il est omis.
ko: 스키마 이름입니다. 생략하면 연결의 현재 스키마를 사용합니다.
tr: Şema adı. Boş bırakıldığında bağlantının geçerli şemasını kullanır.
vi: Tên schema. Bỏ trống thì dùng schema hiện tại của kết nối.
zh_hans: Schema 名称。省略时使用该连接的当前 Schema。
zh_hant: 綱要名稱。省略時使用該連線的目前綱要。

source: Choose a public key file
fr: Choisissez un fichier de clé publique

source: Query executing
fr: Exécution de la requête
ko: 쿼리 실행 중
tr: Sorgu çalışıyor
vi: Đang thực hiện truy vấn
zh_hans: 正在执行查询
zh_hant: 正在執行查詢

source: %1$@ must be at least %2$lld.
fr: %1$@ doit être au moins %2$lld.

source: Failed to fetch table structure: %@
fr: Échec de la récupération de la structure de la table : %@
ko: 테이블 구조를 가져오지 못했습니다: %@
tr: Failed to fetch tablo structure: %@
vi: Lấy cấu trúc bảng thất bại: %@
zh_hans: 获取表结构失败: %@
zh_hant: 取得資料表結構失敗：%@

source: Rows in this export
fr: Lignes dans cette exportation
ko: 이 내보내기의 행
tr: Bu dışa aktarmadaki satırlar
vi: Số dòng trong bản xuất này
zh_hans: 此次导出中的行
zh_hant: 此次匯出中的列

source: Partial index predicate
fr: Prédicat d'indice partiel
ko: 부분 인덱스 조건식
tr: Kısmi indeks koşulu
vi: Điều kiện của chỉ mục một phần
zh_hans: 部分索引的谓词
zh_hant: 部分索引的述詞

source: Find and Replace…
fr: Trouver et remplacer...
ko: 찾기 및 바꾸기…
tr: Bul ve Değiştir…
vi: Tìm và thay thế…
zh_hans: 查找与替换…
zh_hant: 尋找與取代…

source: Duplicate it to customize colors.
fr: Dupliquez-le pour personnaliser les couleurs.
ko: 복제본을 만들어 색상을 사용자화하십시오.
tr: Renkleri özelleştirmek için çoğaltın.
vi: Nhân bản để tuỳ chỉnh màu sắc.
zh_hans: 复制以自定义颜色。
zh_hant: 製作複本即可自訂顏色。

source: This server has no databases yet.
fr: Ce serveur n'a pas encore de bases de données.
ko: 이 서버에는 아직 데이터베이스가 없습니다.
tr: Bu sunucuda henüz veritabanı yok.
vi: Máy chủ này chưa có cơ sở dữ liệu nào.
zh_hans: 此服务器还没有数据库。
zh_hant: 此伺服器還沒有資料庫。

source: %lld pending changes
fr: %lld changements en attente
ko: %lld개 보류 중인 변경 사항
tr: %lld bekleyen değişiklik
vi: %lld thay đổi đang chờ
zh_hans: %lld 项待应用的更改
zh_hant: %lld 項待套用的變更

source: Color the whole row, or only the matching cell
fr: Coupez la toute la rangée, ou seulement la cellule correspondante.

source: New Folder
fr: Nouvelle dossier
ko: 새 폴더
tr: Yeni Klasör
vi: Thư mục mới
zh_hans: 新建文件夹
zh_hant: 新增資料夾

source: Data loss
fr: Perte de données
ko: 데이터 손실
tr: Veri kaybı
vi: Mất dữ liệu
zh_hans: 数据丢失
zh_hant: 資料遺失

source: Drawing %d shapes with no SRID, read as longitude and latitude.
fr: Dessiner %d formes sans SRID, lu comme longitude et latitude.

source: Do Not Decode
fr: Ne pas décoder
ko: 디코딩 안 함
tr: Kodu Çözme
vi: Không giải mã
zh_hans: 不解码
zh_hant: 不解碼

source: Switch the active schema on a connection
fr: Changer le schéma actif sur une connexion
ko: 연결의 활성 스키마를 전환합니다
tr: Bir bağlantıdaki etkin şemayı değiştirir
vi: Chuyển schema đang hoạt động trên một kết nối
zh_hans: 切换连接的活动 Schema
zh_hant: 切換連線上使用中的綱要

source: Explain this SQL query: ```sql %@ ```
fr: Expliquez cette requête SQL : ```sql %@ ```
ko: 이 SQL 쿼리를 설명하십시오: ```sql %@ ```
tr: Bu SQL sorgusunu açıkla: ```sql %@ ```
vi: Giải thích chi tiết câu truy vấn SQL sau: ```sql %@ ```
zh_hans: 请解释以下 SQL 查询: ```sql %@ ```
zh_hant: 請解釋以下 SQL 查詢： ```sql %@ ```

source: Keep This Mac's Version
fr: Gardez la version de ce Mac
ko: 이 Mac의 버전 유지
vi: Giữ phiên bản máy Mac này
zh_hans: 保留此 Mac 的版本
zh_hant: 保留此 Mac 的版本

source: Group results by difference or object type
fr: Résultats de groupe par différence ou type d'objet
ko: 차이점 또는 객체 유형으로 결과 그룹화
tr: Sonuçları farka veya nesne türüne göre grupla
vi: Nhóm kết quả theo khác biệt hoặc loại đối tượng
zh_hans: 按差异或对象类型对结果分组
zh_hant: 依差異或物件類型將結果分組

source: Add a connection before comparing.
fr: Ajoutez une connexion avant de comparer.
ko: 비교하기 전에 연결을 추가하십시오.
tr: Karşılaştırmadan önce bir bağlantı ekleyin.
vi: Hãy thêm một kết nối trước khi so sánh.
zh_hans: 请先添加一个连接再比较。
zh_hant: 請先新增一個連線再比較。

# Claude Code %@ is too old. Version %@ or newer is required.
source: Claude Code %1$@ is too old. Version %2$@ or newer is required.
fr: Le code Claude %1$@ est trop ancien. La version %2$@ ou ultérieure est requise.
ko: Claude Code 버전이 너무 오래되었습니다(%1$@). %2$@ 이상이 필요합니다.
tr: Claude Code %1$@ çok eski. %2$@ veya daha yeni bir sürüm gerekir.
vi: Claude Code %1$@ đã quá cũ. Cần phiên bản %2$@ trở lên.
zh_hans: Claude Code %1$@ 版本过旧。需要 %2$@ 或更高版本。
zh_hant: Claude Code %1$@ 版本過舊。需要 %2$@ 或更新的版本。

source: Remote Database File
fr: Fichier de base de données à distance
ko: 원격 데이터베이스 파일
tr: Uzak Veritabanı Dosyası
vi: Tệp cơ sở dữ liệu từ xa
zh_hans: 远程数据库文件
zh_hant: 遠端資料庫檔案

source: Enter the code %@ in the browser to finish signing in to Microsoft Entra ID. The code is on your clipboard.
fr: Entrez le code %@ dans le navigateur pour terminer la connexion à Microsoft Entra ID. Le code se trouve dans votre presse-papiers.
ko: 코드 %@을(를) 브라우저에 입력하여 Microsoft Entra ID 로그인을 완료하십시오. 코드는 클립보드에 복사되어 있습니다.
tr: Microsoft Entra ID oturumunu tamamlamak için tarayıcıya %@ kodunu girin. Kod panonuzda.
vi: Nhập mã %@ trong trình duyệt để hoàn tất đăng nhập Microsoft Entra ID. Mã đã được sao chép vào bộ nhớ tạm.
zh_hans: 在浏览器中输入代码 %@ 以完成 Microsoft Entra ID 登录。该代码已复制到剪贴板。
zh_hant: 在瀏覽器中輸入代碼 %@ 以完成 Microsoft Entra ID 登入。該代碼已複製到剪貼簿。

source: Database Index: %lld
fr: Index de la base de données : %lld
ko: 데이터베이스 인덱스: %lld
tr: Veritabanı İndeksi: %lld
vi: Chỉ mục cơ sở dữ liệu: %lld
zh_hans: 数据库索引: %lld
zh_hant: 資料庫索引：%lld

source: cloudflared failed to start.
fr: cloudflared n'a pas pu démarrer.
ko: cloudflared를 시작하지 못했습니다.
tr: cloudflared başlatılamadı.
vi: cloudflared không khởi động được.
zh_hans: cloudflared启动失败。
zh_hant: cloudflared 啟動失敗。

source: %@, running
fr: %@, en cours de mise en œuvre

source: Text Viewer
fr: Visualiseur de texte
ko: 텍스트 뷰어
tr: Metin Görüntüleyici
vi: Trình xem văn bản
zh_hans: 文本查看器
zh_hant: 文字檢視器

source: Its definition names the source's own database or schema, so it is only copied where that name is the same.
fr: Sa définition nomme la propre base de données ou le propre schéma de la source, de sorte qu'elle n'est copiée que là où ce nom est le même.

source: Install it with “brew install libpq”.
fr: Installez-le avec "brew install libpq".

source: Database names, sorted
fr: Noms de bases de données, triés
ko: 정렬된 데이터베이스 이름
tr: Veritabanı adları, sıralı
vi: Tên cơ sở dữ liệu, đã sắp xếp
zh_hans: 已排序的数据库名称
zh_hant: 已排序的資料庫名稱

source: Count Exactly
fr: Comptez exactement
ko: 정확히 계산
tr: Tam say
vi: Đếm chính xác
zh_hans: 精确计数
zh_hant: 精確計算

source: View that was read
fr: Voir ce qui a été lu
ko: 읽은 뷰
tr: Okunan görünüm
vi: View đã được đọc
zh_hans: 被读取的视图
zh_hant: 被讀取的檢視表

source: Copy To
fr: Copier vers

source: Export Error
fr: Erreur d'exportation
ko: 내보내기 오류
tr: Dışa Aktarma Hatası
vi: Lỗi xuất dữ liệu
zh_hans: 导出错误
zh_hant: 匯出錯誤

source: Import finished
fr: Importation terminée
ko: 가져오기 완료
tr: İçe aktarma bitti
vi: Nhập xong
zh_hans: 导入完成
zh_hant: 匯入完成

source: %@ objects
fr: %@ objets

source: Foreign keys the table declares
fr: Les clés étrangères que la table déclare
ko: 테이블이 선언한 외래 키
tr: Tablonun bildirdiği yabancı anahtarlar
vi: Các khoá ngoại mà bảng khai báo
zh_hans: 该表声明的外键
zh_hant: 該資料表宣告的外鍵

source: Second rule value
fr: Valeur de la deuxième règle
